user-4.1/tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgs2D/system/region_static/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
//         movingWall
//         {
//             type            directMappedWall;
//             sampleMode      nearestPatchFace;
//             sampleRegion    region_fluid;
//             samplePatch     movingWall;
//             offset          (0 0 0);
//         }

//         fixedMesh
//         {
//             type            directMappedPatch;
//             sampleMode      nearestPatchFace;
//             sampleRegion    region_dynamic;
//             samplePatch     fixedMesh;
//             offset          (0 0 0);
//         }
    }
}

// ************************************************************************* //
